---
kind: property
id: P:Autodesk.Revit.DB.DirectShapeType.UserAssignability
source: html/3a4036c3-6e64-6b5f-1246-fe8ef68a7526.htm
---
# Autodesk.Revit.DB.DirectShapeType.UserAssignability Property

An option controlling the ability of DirectShapes to assign this DirectShapeType as its type.

## Syntax (C#)
```csharp
public DirectShapeTypeUserAssignability UserAssignability { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration